Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/registrUser/Ext/Module.bsl
Функция registrUserGET(Запрос) 
	    
    Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
    Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("phone"));
        	
    СуществующийПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Логин);
    Если СуществующийПользовательИБ <> Неопределено Тогда
            Ответ = Новый HTTPСервисОтвет(400);
    		Ответ.УстановитьТелоИзСтроки("Ошибка.");
    		Возврат Ответ;
    КонецЕсли;
    
    НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользовательИБ.Имя = Логин;
    НовыйПользовательИБ.ПолноеИмя = Логин;
    НовыйПользовательИБ.Пароль = Логин;
    
    НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
    НовыйПользовательИБ.Записать();
    
    УИДПользователя = НовыйПользовательИБ.УникальныйИдентификатор;
    
    НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКонтрагент.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Покупатели"); 
    НовыйКонтрагент.Наименование = Логин;  
	НовыйКонтрагент.КонтактныйТелефон = Телефон; 
    НовыйКонтрагент.Комментарий = "Контрагент зарегистрирован через мобильное приложение";
    НовыйКонтрагент.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель");
    НовыйКонтрагент.Записать();
      
    НовыйПользовательСпр = Справочники.Пользователи.СоздатьЭлемент();
    НовыйПользовательСпр.Наименование = Логин;  
	НовыйПользовательСпр.Код = Строка(УИДПользователя);  
    НовыйПользовательСпр.Клиент = НовыйКонтрагент.Ссылка;  
    НовыйПользовательСпр.Записать();
    	
    ДанныеПользователя = Новый Структура;
    ДанныеПользователя.Вставить("name", Логин);     
	ДанныеПользователя.Вставить("code", Строка(УИДПользователя));   
	ДанныеПользователя.Вставить("phone", Телефон);   
    ДанныеПользователя.Вставить("userId", Строка(УИДПользователя));  
	
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, ДанныеПользователя);
    СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200); 
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	
    Возврат Ответ;
    
КонецФункции
